In [ ]:
# importing required libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from matplotlib import style

##Importing all the files for Merging data

In [ ]:
#importing all the files
movie=pd.read_csv("movies.csv") # contains movie details( movie_id, movie_name, genre)
rating=pd.read_csv("ratings.csv") #contains rating data given by user for each movie(userId,movieId,rating,timestamp)
tags=pd.read_csv("tags.csv") #Tags given by user to a movie (userId,movieId,tag,timestamp)
links=pd.read_csv("links.csv") # imdbid tmdbId  data
columns=["userId","Age","Sex","occupation","Zip"] # column for user data
users=pd.read_csv("u.user",header=None,names=columns) # Users data file containing details of users who gave the rating and tags

In [ ]:
# Splitting the text to Dataframe columns 
users=users["userId"].str.split('|',expand=True)

In [ ]:
#Renaming the Columns
users=users.rename(columns={0:"userId",1:"Age",2:"Sex",3:"occupation",4:"Zip"})

In [ ]:
#User dataframe
users.head()

  userId Age Sex  occupation    Zip
0      1  24   M  technician  85711
1      2  53   F       other  94043
2      3  23   M      writer  32067
3      4  24   M  technician  43537
4      5  33   F       other  15213

In [ ]:
#Movie data
movie.head(5)

   movieId  ...                                       genres
0        1  ...  Adventure|Animation|Children|Comedy|Fantasy
1        2  ...                   Adventure|Children|Fantasy
2        3  ...                               Comedy|Romance
3        4  ...                         Comedy|Drama|Romance
4        5  ...                                       Comedy

[5 rows x 3 columns]

In [ ]:
#Rating Data
rating.head(5)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
#Users who gave the ratings
rating['userId'].value_counts()

414    2698
599    2478
474    2108
448    1864
274    1346
       ...
406      20
595      20
569      20
431      20
442      20
Name: userId, Length: 610, dtype: int64

In [ ]:
#Rating of user who's Id is 1
rating[rating["userId"]==1]

     userId  movieId  rating  timestamp
0         1        1     4.0  964982703
1         1        3     4.0  964981247
2         1        6     4.0  964982224
3         1       47     5.0  964983815
4         1       50     5.0  964982931
..      ...      ...     ...        ...
227       1     3744     4.0  964980694
228       1     3793     5.0  964981855
229       1     3809     4.0  964981220
230       1     4006     4.0  964982903
231       1     5060     5.0  964984002

[232 rows x 4 columns]

In [ ]:
#Links of imdb and tmdbId of movie
links.head(5)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [ ]:
#Tags used by different users for different movies
tags.head(5)

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

##Merging the Tagged data with each movie

In [ ]:

movie_ratings=movie
movie_ratings["tag"]=""
#Collecting all the tages used for each movie from tag table
j=0
for i in movie_ratings["movieId"]:
  x=tags[tags["movieId"]==i]["tag"].values  #Creating an array of tags from tags file for a movie
  movie_ratings.iloc[j,-1]=np.array_str(x) #Storing the array of tags into movie_rating column
  j+=1

In [ ]:
#Merging links to movie
movie_ratings=pd.merge(movie,links,on="movieId")

In [ ]:
#Merging tag and rating table 
tag_rating=pd.merge(rating,tags,on="movieId",indicator=True)

In [ ]:
#Mergin Tag and rating files 
tag_rating.head()

   userId_x  movieId  rating  timestamp_x  userId_y    tag  timestamp_y _merge
0         1        1     4.0    964982703       336  pixar   1139045764   both
1         1        1     4.0    964982703       474  pixar   1137206825   both
2         1        1     4.0    964982703       567    fun   1525286013   both
3         5        1     4.0    847434962       336  pixar   1139045764   both
4         5        1     4.0    847434962       474  pixar   1137206825   both

In [ ]:
#movie dataframe after merging links and tags table
movie_ratings.head()

   movieId                               title  ...  imdbId   tmdbId
0        1                    Toy Story (1995)  ...  114709    862.0
1        2                      Jumanji (1995)  ...  113497   8844.0
2        3             Grumpier Old Men (1995)  ...  113228  15602.0
3        4            Waiting to Exhale (1995)  ...  114885  31357.0
4        5  Father of the Bride Part II (1995)  ...  113041  11862.0

[5 rows x 6 columns]

In [ ]:
rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

## Merging  User and Rating Table and storing the User data and users given rating(in the form of array) for each movie in a movie_rating dataframe

In [ ]:
# Creating Users and Ratings column in Movie_ratings dataset to store all the users who rated the movie along with rating points
movie_ratings["Users"]=""
movie_ratings["Ratings"]=""
j=0
for i in movie_ratings["movieId"]:
  x=rating[rating["movieId"]==i]["userId"].values
  movie_ratings.iloc[j,-2]=np.array_str(x)
  j+=1
j=0
for i in movie_ratings["movieId"]:
  x=rating[rating["movieId"]==i]["rating"].values
  movie_ratings.iloc[j,-1]=np.array_str(x)
  j+=1

In [ ]:
#Removing \n from dataset
movie_ratings = movie_ratings.replace('\n',' ', regex=True)

In [ ]:
# Here we have "Users":containing list of userId and "Ratings": Rating given by each users for each movie
#Users data == Ratings data. Each userId is pointing to each Ratings point in rating list
movie_ratings.head()

   movieId  ...                                            Ratings
0        1  ...  [4.  4.  4.5 2.5 4.5 3.5 4.  3.5 3.  5.  3.  3...
1        2  ...  [4.  4.  3.  3.  3.  3.5 4.  4.5 4.  2.5 3.  3...
2        3  ...  [4.  5.  3.  3.  4.  5.  3.  4.  3.  3.5 2.  3...
3        4  ...                      [3.  3.  3.  3.  1.  2.  1.5]
4        5  ...  [5.  3.  5.  3.  4.  4.  2.  3.  4.  4.  3.5 3...

[5 rows x 8 columns]

In [ ]:
movie_integrate=users

##Creating a Dataset which will contain user data and movies list along with ratings given for each movie in the form of list

In [ ]:
#Movie integate dataset: Eachusers rated movie in form of array
movie_integrate.head()

  userId Age Sex  occupation    Zip
0      1  24   M  technician  85711
1      2  53   F       other  94043
2      3  23   M      writer  32067
3      4  24   M  technician  43537
4      5  33   F       other  15213

In [ ]:
#Rating Data
rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [ ]:
#Only 610 users gave the rating rest can be ignored
users=users.iloc[:610]

In [ ]:
#Users
len(users)

610

In [ ]:
# Creating Users and Ratings column in Movie dataset to store all the users who rated the movie along with rating points
movie_integrate["Movie_id"]=""
movie_integrate["Ratings"]=""
j=0
for i in users["userId"]:
  x=rating[rating["userId"]==int(i)]["movieId"].values #array of movieId for each user who rated the movie
  movie_integrate.loc[j,"Movie_id"]=x
  j+=1
j=0
for i in users["userId"]:
  x=rating[rating["userId"]==int(i)]["rating"].values #array of ratings given by each user for a movie
  movie_integrate.loc[j,"Ratings"]=np.array_str(x)
  j+=1

In [ ]:
#Removing \n from dataset
movie_integrate = movie_integrate.replace('\n',' ', regex=True)
movie_integrate=movie_integrate.iloc[:610]

In [ ]:
# Here we are seeing the data from user's perspective 
# "Movie_id" column: All the movies a user watched
#"Ratings" column: Given rating for each movie by user
movie_integrate.head()

  userId  ...                                            Ratings
0      1  ...  [4. 4. 4. 5. 5. 3. 5. 4. 5. 5. 5. 5. 3. 5. 4. ...
1      2  ...  [3.  4.  4.5 4.  4.  3.5 4.  4.  4.5 5.  4.5 3...
2      3  ...  [0.5 0.5 0.5 0.5 0.5 5.  0.5 0.5 0.5 0.5 0.5 3...
3      4  ...  [3. 2. 3. 2. 3. 3. 4. 5. 1. 5. 3. 5. 2. 5. 1. ...
4      5  ...  [4. 4. 4. 4. 3. 4. 5. 4. 3. 3. 4. 5. 3. 4. 3. ...

[5 rows x 7 columns]

In [ ]:
#Creating CSV file after mergin the User data with movies and Rating that he provided
movie_integrate.to_csv("movie_integrate.csv")

In [ ]:
#Creating CSV file by mergin users and ratings to each movie
movie_ratings.to_csv("movie_rating.csv")